app/controllers/achievements_controller.rb

  def create
    @achievement = Achievement.create(achievement_params)
---
INSERT INTO "achievements" ("name", "team", "headline", "description", "categories", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def index
    @achievements = Achievement.all
---
SELECT "achievements".* FROM "achievements"